//2. მოცემულია მასივი, შემდეგი მნიშვნელობებით - let array1 =[“hello1”, 14,24, “hello2”] გამოიტანეთ მარტო ციფრები მეთოდის საშუალებით;

let array1 = ["hello", 14, 24, "hello2"];
let Numbers = array1.filter((num) => num >= 0 || num <= 0);
 console.log(Numbers)


//2.მოცემულია მასიცი:let array2 = [14, 150, 'css', null, 'javascript', 25];
//შექმენით ახალი მასივი map ფუნქციის საშუალებით შემდეგი ლოგიკით: თუ ელემენტი არის რიცხვი, ამ მასივში უნდა იყოს ამ რიცხვის კვადრატი. თუ ელემენტი არის სტირნგი, მაშინ ახალ მასივში უნდა იყოს ეს ტექსტი დიდი ასოებით. სხვა შემთხვევაში ელემენტი უნდა დაემატოს უცვლელად

//ver gavakete

//3.მოცემულია სტრინგი: let info= ‘Good day”, ამოიღეთ სიტყვა day და ჩასვით ახალ ცვლადში slice მეთოდის საშუელებით.

let info = "good day"
let newInfo =slice(start,end)
console.log(newInfo);

4.დაწერეთ ფუნქცია, რომელიც პარამეტრსდ იღებს სტრინგს, და დააბრუნებს ჩაწერილი სტრინგის სიგრძეს.

// 5. Prompt ფუნქციის საშუალებით კითხეთ მომხმარებელს შემდეგი კითხვა: საქართველოს დედაქალაქი? 
//სწორი პასუხი ჩაწერეთ პატარა ასობიეთ და  შეინახეთ ცვლადში. როდესაც მიიღებთ პასუხს მომხმარებლისგან,
// გადაიყვანეთ ეს პასუხი პატარა ასოებად და შეადარეთ სწორ პასუხს. თუ მომხმარებლის პასუხი სწორია, 
//დაბეჭდეთ სწორია, თუ არა მაშინ დაბეჭდეთ არასწორია.


let question = promt(საქართველოს დედაქალაქი)
let answer = "tbilisi"
//ვერ გავაკეთე

//6.მოცემულია: let link = “https://google.com”. დაწერეთ ფუნქცია, რომელიც პარამეტრად იღებს ამ ცვლადს, 
//და შეამოწმეთ indexof მეთოდის საშუალებით არის თუ არა ამ ცვლადში “https://“.
 //თუ კი გამოიტანეთ - კი მოიცავს, თუ არა - არა, არ მოიცავს.


 //ver gavakete


 //7.მოცემულია მასივი, რომელშიც არის ერთზე მეტი მნიშვნელობა, მაგრამ კონკრეტულად რამდენი არ ვიცით,
  //შეიძლება 100 ან 200 ან 10. მაგ: let fruits = [“apple”, “mango”, “avocado”,”kiwi”]  splice მეთოდის საშუალებით
   //წაშალეთ ბოლოს წინა მნიშვნელობა და მაგის მავივრად ჩასვით “strawberry”. 	

   let fruits1 = ["Apple", "Mango", "Avocado", "Kiwi"];
   fruits1.splice(-2, 1, 'Strawberry');
    console.log(fruits1);


//8.შექმენით მასივი, რომლის საწყისი მნიშვნელობა იქნება რიცხვები: 5, 25, 89, 120, 36;

 // მასივის ბოლოში დაამატეთ ორი ელემენტი(სტრინგი): javascript და python;
  //მასივის დასაწყისში კი დაამატეთ ელემენტი(სტრინგი): html და css;
  //გამოიტანეთ ეკრანზე, რამდენი ელემენტი გაქვთ მასივში;
  //წაშალეთ მასივიდან პირველი და ბოლო ელემენტი;
  //დაბეჭდეთ მასივისი ახალი ელემენტები

  let array = [5,25,89,120,36]
  array.push("javascript", "python")
  array.unshift("html", "css")
  console.log(array.length);
  console.log(array);
  array.shift()
  array.pop()
  console.log(array);



  
// 9. შექმენით მასივი, შემდეგი ელემენტებით: ფორთოხალი, ბანანი, მსხალი;
//გამოიტანეთ ინფორმაცია ეკრანზე თუ რამდენი ელემენტი გაქვთ მასივში;
//მასივის ბოლოს დაამატეთ ორი ელემენტი: ვაშლი და ანანასი;
//მასივის დასაწყისში კი დაამატეთ ელემენტი: საზამთრო;
//გამოიტანეთ ეკრანზე, რამდენი ელემენტი გაქვთ მასივში;
//მასივის მე-3 ადგილას დაამატეთ ელემენტი: მანგო;1
//წაშალეთ მასივიდან პირველი და ბოლო ელემენტი;
//გამოიტანეთ ეკრანზე, თუ რამდენი ელემენტი დარჩა მასივში;


let fruits = ["oringe", "babana","pear"]
fruits.push("apple", "pineapple") 
fruits.unshift("wattermelon")
console.log(fruits.length);
fruits.splice(2, 0, "mango")
fruits.shift()
fruits.pop()
console.log(fruits);

//10. მოცემულია მასივი let array =[1, 2, 3, 4, 5]. Splice მეთოდის საშუალებით მიიღეთ: [1, 2, 3, 'a', 'b', 'c', 4, 5].

let array4 =[1, 2, 3, 4, 5]
array4.splice(3, 0, "a", "b", "c")
console.log(array4);

// 11.მოცემულია მასივი:
//let arr = [1, 2, 3, 4, 5];
//Foreach საშუალებით გამოთვალეთ რიცხვების ჯამი

let arr = [1,2,3,4,5]
arr.forEach(a){
    console.log();
}


// 12.  მოცემულია მასივი:
//Let  array = [12, 25, 3, 6, 8, 14, 7, 23];
//map-ის გამოყენებით შექმენით ახალი მასივი, რომელშიც array მასივიდან თითოეული ელემენტი იქნება 3-ზე გაყოფილი;

let  array = [12, 25, 3, 6, 8, 14, 7, 23];
let mapArray = array.map((numb) => Math.round(numb / 3));
console.log(mapArray);

// 13მოცემულია მასივი:
//let languages = ['html', 'css', 'javascript', ‘python’, 'php'];
//ფილტრის საშულებით გაფილტრეთ და გამოიტანეთ მარტო ის სიტყვები რომლების სიმბოლოების რაოდენობა იქნება 3-ზე მეტი;

let languages = ["html", "css", "javascript", "python", "php"]

let useFilter = languages.filter((word) => word.length > 3);
 console.log(useFilter);


 // 14.Მოცემულია მასივი:
//let words = ['Madrid', 'Rome', 'Milan', 'Berlin'];
//Filter მეთოდის საშუალებით დააბრუნეთ მასივი, რომელიც შედგება ისეთი სიტყვებისგან რომელიც შეიცავს ასო m-ს ან M-ს;



let words = ['Madrid', 'Rome', 'Milan', 'Berlin'];
let newFilter = words.filter((word) => word.includes('m') || word.includes('M'));
console.log(newFilter);


// 15.შეამოწმეთ მოცელუმ მასივში let arr = [-1, -2, -3, 4]; არის თუ არა ერთი მაინც დადებითი რიცხვი some მეთოდით.(ver gavakete)
//ver gavakete

// 16. მოცემულია მასივი: [15, 100, 25, 10, 36]
 // წაშალეთ ამ
  //მასივიდან რიცხვი 10;

  let numbersArray = [15,100,25,10,36]
  numbersArray.splice(3, 1)
  console.log(numbersArray);
  